[Survived] BlockStatement
src/url-encoding.ts:5:57
 import type { Graph } from "@swoopy/engine";
 import { serialize, deserialize } from "@swoopy/engine";
 
-export function encodeGraphForUrl(graph: Graph): string {
-  const serialized = serialize(graph);
-  const json = JSON.stringify(JSON.parse(JSON.stringify(serialized)));
-  const bytes = new TextEncoder().encode(json);
-  const compressed = deflateSync(bytes, { raw: true } as Parameters<
-    typeof deflateSync
-  >[1]);
-  let binary = "";
-  const chunk = 0x8000;
-  for (let i = 0; i < compressed.length; i += chunk) {
-    binary += String.fromCharCode(...compressed.subarray(i, i + chunk));
-  }
-  return btoa(binary);
-}
+export function encodeGraphForUrl(graph: Graph): string {}
 
 export function decodeGraphFromUrl(encoded: string): Graph | null {

[Survived] AssignmentOperator
src/url-encoding.ts:14:42
   >[1]);
   let binary = "";
   const chunk = 0x8000;
-  for (let i = 0; i < compressed.length; i += chunk) {
+  for (let i = 0; i < compressed.length; i -= chunk) {
     binary += String.fromCharCode(...compressed.subarray(i, i + chunk));
   }

[Survived] EqualityOperator
src/url-encoding.ts:14:19
   >[1]);
   let binary = "";
   const chunk = 0x8000;
-  for (let i = 0; i < compressed.length; i += chunk) {
+  for (let i = 0; i <= compressed.length; i += chunk) {
     binary += String.fromCharCode(...compressed.subarray(i, i + chunk));
   }

[Survived] BlockStatement
src/url-encoding.ts:20:67
   return btoa(binary);
 }
 
-export function decodeGraphFromUrl(encoded: string): Graph | null {
-  if (!encoded) return null;
-  try {
-    const bytes = Uint8Array.from(atob(encoded), (c) => c.charCodeAt(0));
-    try {
-      const inflated = inflateSync(bytes, { raw: true } as Parameters<
-        typeof inflateSync
-      >[1]);
-      const json = new TextDecoder().decode(inflated);
-      return deserialize(JSON.parse(json));
-    } catch {
-      const json = new TextDecoder().decode(bytes);
-      return deserialize(JSON.parse(json));
-    }
-  } catch {
-    return null;
-  }
-}
+export function decodeGraphFromUrl(encoded: string): Graph | null {}
 

[Survived] ConditionalExpression
src/url-encoding.ts:21:7
 }
 
 export function decodeGraphFromUrl(encoded: string): Graph | null {
-  if (!encoded) return null;
+  if (false) return null;
   try {
     const bytes = Uint8Array.from(atob(encoded), (c) => c.charCodeAt(0));

[Survived] BlockStatement
src/url-encoding.ts:22:7
 
 export function decodeGraphFromUrl(encoded: string): Graph | null {
   if (!encoded) return null;
-  try {
-    const bytes = Uint8Array.from(atob(encoded), (c) => c.charCodeAt(0));
-    try {
-      const inflated = inflateSync(bytes, { raw: true } as Parameters<
-        typeof inflateSync
-      >[1]);
-      const json = new TextDecoder().decode(inflated);
-      return deserialize(JSON.parse(json));
-    } catch {
-      const json = new TextDecoder().decode(bytes);
-      return deserialize(JSON.parse(json));
-    }
-  } catch {
+  try {} catch {
     return null;
   }

[Survived] BlockStatement
src/url-encoding.ts:24:9
   if (!encoded) return null;
   try {
     const bytes = Uint8Array.from(atob(encoded), (c) => c.charCodeAt(0));
-    try {
-      const inflated = inflateSync(bytes, { raw: true } as Parameters<
-        typeof inflateSync
-      >[1]);
-      const json = new TextDecoder().decode(inflated);
-      return deserialize(JSON.parse(json));
-    } catch {
+    try {} catch {
       const json = new TextDecoder().decode(bytes);
       return deserialize(JSON.parse(json));
