[Killed] BlockStatement
src/url-encoding.ts:11:54
   const compressed = deflateSync(bytes, { raw: true });
   let binary = "";
   const chunk = 0x8000;
-  for (let i = 0; i < compressed.length; i += chunk) {
-    binary += String.fromCharCode(...compressed.subarray(i, i + chunk));
-  }
+  for (let i = 0; i < compressed.length; i += chunk) {}
   return btoa(binary);
 }
killedBy: persistence round-trip (integration) shareGraph → loadFromUrl restores the graph exactly
statusReason: expected [] to have a length of 2 but got +0
