[Killed] BlockStatement
packages/app/src/url-encoding.ts:5:57
 import type { Graph } from "@swoopy/engine";
 import { serialize, deserialize } from "@swoopy/engine";
 
-export function encodeGraphForUrl(graph: Graph): string {
-  const json = JSON.stringify(serialize(graph));
-  const bytes = new TextEncoder().encode(json);
-  const compressed = deflateSync(bytes, { raw: true });
-  let binary = "";
-  const chunk = 0x8000;
-  for (let i = 0; i < compressed.length; i += chunk) {
-    binary += String.fromCharCode(...compressed.subarray(i, i + chunk));
-  }
-  return btoa(binary);
-}
+export function encodeGraphForUrl(graph: Graph): string {}
 
 export function decodeGraphFromUrl(encoded: string): Graph | null {
killedBy: SE-02 / SE-06: shareGraph encodes the current graph as base64 in a URL query param and writes it to the clipboard
statusReason: Target cannot be null or undefined.

[Survived] BooleanLiteral
packages/app/src/url-encoding.ts:8:48
 export function encodeGraphForUrl(graph: Graph): string {
   const json = JSON.stringify(serialize(graph));
   const bytes = new TextEncoder().encode(json);
-  const compressed = deflateSync(bytes, { raw: true });
+  const compressed = deflateSync(bytes, { raw: false });
   let binary = "";
   const chunk = 0x8000;

[Killed] StringLiteral
packages/app/src/url-encoding.ts:9:16
   const json = JSON.stringify(serialize(graph));
   const bytes = new TextEncoder().encode(json);
   const compressed = deflateSync(bytes, { raw: true });
-  let binary = "";
+  let binary = "Stryker was here!";
   const chunk = 0x8000;
   for (let i = 0; i < compressed.length; i += chunk) {
killedBy: SE-02 / SE-06: shareGraph encodes the current graph as base64 in a URL query param and writes it to the clipboard
statusReason: Target cannot be null or undefined.

[Killed] ConditionalExpression
packages/app/src/url-encoding.ts:11:19
   const compressed = deflateSync(bytes, { raw: true });
   let binary = "";
   const chunk = 0x8000;
-  for (let i = 0; i < compressed.length; i += chunk) {
+  for (let i = 0; false; i += chunk) {
     binary += String.fromCharCode(...compressed.subarray(i, i + chunk));
   }
killedBy: SE-02 / SE-06: shareGraph encodes the current graph as base64 in a URL query param and writes it to the clipboard
statusReason: Target cannot be null or undefined.

[Killed] EqualityOperator
packages/app/src/url-encoding.ts:11:19
   const compressed = deflateSync(bytes, { raw: true });
   let binary = "";
   const chunk = 0x8000;
-  for (let i = 0; i < compressed.length; i += chunk) {
+  for (let i = 0; i >= compressed.length; i += chunk) {
     binary += String.fromCharCode(...compressed.subarray(i, i + chunk));
   }
killedBy: SE-02 / SE-06: shareGraph encodes the current graph as base64 in a URL query param and writes it to the clipboard
statusReason: Target cannot be null or undefined.

[Killed] AssignmentOperator
packages/app/src/url-encoding.ts:12:5
   let binary = "";
   const chunk = 0x8000;
   for (let i = 0; i < compressed.length; i += chunk) {
-    binary += String.fromCharCode(...compressed.subarray(i, i + chunk));
+    binary -= String.fromCharCode(...compressed.subarray(i, i + chunk));
   }
   return btoa(binary);
killedBy: SE-02 / SE-06: shareGraph encodes the current graph as base64 in a URL query param and writes it to the clipboard
statusReason: Target cannot be null or undefined.

[Killed] ArithmeticOperator
packages/app/src/url-encoding.ts:12:61
   let binary = "";
   const chunk = 0x8000;
   for (let i = 0; i < compressed.length; i += chunk) {
-    binary += String.fromCharCode(...compressed.subarray(i, i + chunk));
+    binary += String.fromCharCode(...compressed.subarray(i, i - chunk));
   }
   return btoa(binary);
killedBy: SE-02 / SE-06: shareGraph encodes the current graph as base64 in a URL query param and writes it to the clipboard
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
packages/app/src/url-encoding.ts:17:67
   return btoa(binary);
 }
 
-export function decodeGraphFromUrl(encoded: string): Graph | null {
-  if (!encoded) return null;
-  try {
-    const bytes = Uint8Array.from(atob(encoded), (c) => c.charCodeAt(0));
-    try {
-      const inflated = inflateSync(bytes, { raw: true });
-      const json = new TextDecoder().decode(inflated);
-      return deserialize(JSON.parse(json));
-    } catch {
-      const json = new TextDecoder().decode(bytes);
-      return deserialize(JSON.parse(json));
-    }
-  } catch {
-    return null;
-  }
-}
+export function decodeGraphFromUrl(encoded: string): Graph | null {}
 
killedBy: SE-08: model identity loadFromUrl sets transient to true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/app/src/url-encoding.ts:18:7
 }
 
 export function decodeGraphFromUrl(encoded: string): Graph | null {
-  if (!encoded) return null;
+  if (true) return null;
   try {
     const bytes = Uint8Array.from(atob(encoded), (c) => c.charCodeAt(0));
killedBy: SE-08: model identity loadFromUrl sets transient to true
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
packages/app/src/url-encoding.ts:18:7
 }
 
 export function decodeGraphFromUrl(encoded: string): Graph | null {
-  if (!encoded) return null;
+  if (encoded) return null;
   try {
     const bytes = Uint8Array.from(atob(encoded), (c) => c.charCodeAt(0));
killedBy: SE-08: model identity loadFromUrl sets transient to true
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
packages/app/src/url-encoding.ts:19:7
 
 export function decodeGraphFromUrl(encoded: string): Graph | null {
   if (!encoded) return null;
-  try {
-    const bytes = Uint8Array.from(atob(encoded), (c) => c.charCodeAt(0));
-    try {
-      const inflated = inflateSync(bytes, { raw: true });
-      const json = new TextDecoder().decode(inflated);
-      return deserialize(JSON.parse(json));
-    } catch {
-      const json = new TextDecoder().decode(bytes);
-      return deserialize(JSON.parse(json));
-    }
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: SE-08: model identity loadFromUrl sets transient to true
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
packages/app/src/url-encoding.ts:20:50
 export function decodeGraphFromUrl(encoded: string): Graph | null {
   if (!encoded) return null;
   try {
-    const bytes = Uint8Array.from(atob(encoded), (c) => c.charCodeAt(0));
+    const bytes = Uint8Array.from(atob(encoded), () => undefined);
     try {
       const inflated = inflateSync(bytes, { raw: true });
killedBy: SE-08: model identity loadFromUrl sets transient to true
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
packages/app/src/url-encoding.ts:21:9
   if (!encoded) return null;
   try {
     const bytes = Uint8Array.from(atob(encoded), (c) => c.charCodeAt(0));
-    try {
-      const inflated = inflateSync(bytes, { raw: true });
-      const json = new TextDecoder().decode(inflated);
-      return deserialize(JSON.parse(json));
-    } catch {
+    try {} catch {
       const json = new TextDecoder().decode(bytes);
       return deserialize(JSON.parse(json));
killedBy: SE-08: model identity loadFromUrl sets transient to true
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
packages/app/src/url-encoding.ts:22:50
   try {
     const bytes = Uint8Array.from(atob(encoded), (c) => c.charCodeAt(0));
     try {
-      const inflated = inflateSync(bytes, { raw: true });
+      const inflated = inflateSync(bytes, { raw: false });
       const json = new TextDecoder().decode(inflated);
       return deserialize(JSON.parse(json));

[Killed] BlockStatement
packages/app/src/url-encoding.ts:25:13
       const inflated = inflateSync(bytes, { raw: true });
       const json = new TextDecoder().decode(inflated);
       return deserialize(JSON.parse(json));
-    } catch {
-      const json = new TextDecoder().decode(bytes);
-      return deserialize(JSON.parse(json));
-    }
+    } catch {}
   } catch {
     return null;
killedBy: loadFromUrl — compressed + legacy (share-url-compression) loads a legacy plain-base64 ?g= URL correctly (backward compat)
statusReason: expected undefined to be 'c3ae0b5a-b2a3-4323-a684-d1f6218de872' // Object.is equality

[Killed] BlockStatement
packages/app/src/url-encoding.ts:29:11
       const json = new TextDecoder().decode(bytes);
       return deserialize(JSON.parse(json));
     }
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 
killedBy: encodeGraphForUrl / decodeGraphFromUrl returns null for a corrupt string
statusReason: expected undefined to be null
